#![allow(bad_style)]
/* automatically generated by rust-bindgen 0.71.1 */

#[doc = r" If Bindgen could only determine the size and alignment of a"]
#[doc = r" type, it is represented like this."]
#[derive(PartialEq, Copy, Clone, Debug, Hash)]
#[repr(C)]
pub struct __BindgenOpaqueArray<T: Copy, const N: usize>(pub [T; N]);
impl<T: Copy + Default, const N: usize> Default for __BindgenOpaqueArray<T, N> {
    fn default() -> Self {
        Self([<T as Default>::default(); N])
    }
}
pub const WINT_MIN: u32 = 0;
pub const APUCMD_BUFFERSIZE: u32 = 0;
pub const APUCMD_START: u32 = 1;
pub const APUCMD_NOOP1: u32 = 2;
pub const APUCMD_NOOP2: u32 = 3;
pub const APUCMD_SETRATE: u32 = 4;
pub const ONE_SECOND_IN_TICKS: u32 = 10000000;
pub const HALF_SECOND_IN_TICKS: u32 = 5000000;
pub const TWO_HUNDRED_FIFTY_MILLISECONDS_IN_TICKS: u32 = 2500000;
pub const TWO_HUNDRED_MILLISECONDS_IN_TICKS: u32 = 2000000;
pub const HUNDRED_MILLISECONDS_IN_TICKS: u32 = 1000000;
pub const TEN_MILLISECONDS_IN_TICKS: u32 = 100000;
pub const TWO_MILLISECONDS_IN_TICKS: u32 = 20000;
pub const ONE_MILLISECOND_IN_TICKS: u32 = 10000;
pub const HALF_MILLISECOND_IN_TICKS: u32 = 5000;
pub const QUARTER_MILLISECOND_IN_TICKS: u32 = 2500;
pub const ONE_MICROSECOND_IN_TICKS: u32 = 10;
pub const CSR_CPURESET: u32 = 4078;
pub const CSR_WATERMARK: u32 = 4080;
pub const CSR_PROGRAMCOUNTER: u32 = 4092;
pub const CSR_HEAPSTART: u32 = 2304;
pub const CSR_HEAPEND: u32 = 2305;
pub const CSR_BRKPOS: u32 = 2306;

pub const TASK_MAX: u32 = 5;
pub const FP_NAN: u32 = 0;
pub const FP_INFINITE: u32 = 1;
pub const FP_ZERO: u32 = 2;
pub const FP_SUBNORMAL: u32 = 3;
pub const FP_NORMAL: u32 = 4;
pub const MATH_ERRNO: u32 = 1;
pub const MATH_ERREXCEPT: u32 = 2;
pub const BUFSIZ: u32 = 1024;
pub const FOPEN_MAX: u32 = 20;
pub const FILENAME_MAX: u32 = 1024;
pub const SEEK_SET: u32 = 0;
pub const SEEK_CUR: u32 = 1;
pub const SEEK_END: u32 = 2;
pub const TMP_MAX: u32 = 26;
pub const UARTCTL_RESET_TX_FIFO: u32 = 1;
pub const UARTCTL_RESET_RX_FIFO: u32 = 2;
pub const UARTCTL_RESERVED0: u32 = 4;
pub const UARTCTL_RESERVED1: u32 = 8;
pub const UARTCTL_ENABLEINTERRUPT: u32 = 16;
pub const UARTSTA_RXFIFO_VALID: u32 = 1;
pub const UARTSTA_RXFIFO_FULL: u32 = 2;
pub const UARTSTA_TXFIFO_EMPTY: u32 = 4;
pub const UARTSTA_TXFIFO_FULL: u32 = 8;
pub const UARTSTA_INTERRUPTENABLED: u32 = 16;
pub const USBDESCTYPE_UNKNOWN: u32 = 0;
pub const USBDESCTYPE_DEVICE: u32 = 1;
pub const USBDESCTYPE_CONFIGURATION: u32 = 2;
pub const USBDESCTYPE_STRING: u32 = 3;
pub const USBDESCTYPE_INTERFACE: u32 = 4;
pub const USBDESCTYPE_ENDPOINT: u32 = 5;
pub const USBDESCTYPE_DEVICEQUALIFIER: u32 = 6;
pub const USBDESCTYPE_OTHERSPEEDCFG: u32 = 7;
pub const USBDESCTYPE_INTERFACEPOWER: u32 = 8;
pub const USBDESCTYPE_OTG: u32 = 9;
pub const USBDESCTYPE_DEBUG: u32 = 10;
pub const USBDESCTYPE_INTERFACEASSOC: u32 = 11;
pub const USBDESCTYPE_SECURITY: u32 = 12;
pub const USBDESCTYPE_KEY: u32 = 13;
pub const USBDESCTYPE_ENCRYPTTYPE: u32 = 14;
pub const USBDESCTYPE_BINARYDEVOBJSTORE: u32 = 15;
pub const USBDESCTYPE_DEVICECAPABILITY: u32 = 16;
pub const USBDESCTYPE_WIRELESSEPCOMPANION: u32 = 17;
pub const USBDESCTYPE_HIDSPECIFIC: u32 = 33;
pub const USBDESCTYPE_SUPERSPEEDEPCOMPANION: u32 = 48;
pub const USBDESCTYPE_SUPERSPEEDISOEPCOMPANION: u32 = 49;
pub const VPUCMD_SETVPAGE: u32 = 0;
pub const VPUCMD_SETPAL: u32 = 1;
pub const VPUCMD_SETVMODE: u32 = 2;
pub const VPUCMD_CTLREGSEL: u32 = 3;
pub const VPUCMD_CTLREGSET: u32 = 4;
pub const VPUCMD_CTLREGCLR: u32 = 5;
pub const CONSOLEDIMGRAY: u32 = 0;
pub const CONSOLEDIMBLUE: u32 = 1;
pub const CONSOLEDIMGREEN: u32 = 2;
pub const CONSOLEDIMCYAN: u32 = 3;
pub const CONSOLEDIMRED: u32 = 4;
pub const CONSOLEDIMMAGENTA: u32 = 5;
pub const CONSOLEDIMYELLOW: u32 = 6;
pub const CONSOLEDIMWHITE: u32 = 7;
pub const CONSOLEGRAY: u32 = 8;
pub const CONSOLEBLUE: u32 = 9;
pub const CONSOLEGREEN: u32 = 10;
pub const CONSOLECYAN: u32 = 11;
pub const CONSOLERED: u32 = 12;
pub const CONSOLEMAGENTA: u32 = 13;
pub const CONSOLEYELLOW: u32 = 14;
pub const CONSOLEWHITE: u32 = 15;
pub const CONSOLEDEFAULTFG: u32 = 15;
pub const CONSOLEDEFAULTBG: u32 = 9;
pub type __intmax_t = u64;
pub type __uintmax_t = u64;
pub type intmax_t = __intmax_t;
pub type uintmax_t = __uintmax_t;
#[repr(C)]
#[derive(Debug, Default, Copy, Clone, Hash, PartialEq, Eq)]
pub struct imaxdiv_t {
    pub quot: intmax_t,
    pub rem: intmax_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of imaxdiv_t"][::core::mem::size_of::<imaxdiv_t>() - 16usize];
    ["Alignment of imaxdiv_t"][::core::mem::align_of::<imaxdiv_t>() - 8usize];
    ["Offset of field: imaxdiv_t::quot"][::core::mem::offset_of!(imaxdiv_t, quot) - 0usize];
    ["Offset of field: imaxdiv_t::rem"][::core::mem::offset_of!(imaxdiv_t, rem) - 8usize];
};
pub const EAPUSampleRate_ASR_44_100_Hz: EAPUSampleRate = 0;
pub const EAPUSampleRate_ASR_22_050_Hz: EAPUSampleRate = 1;
pub const EAPUSampleRate_ASR_11_025_Hz: EAPUSampleRate = 2;
pub const EAPUSampleRate_ASR_Halt: EAPUSampleRate = 3;
pub type EAPUSampleRate = ::core::ffi::c_uint;
pub type _off_t = u32;
pub type _fpos_t = u32;
#[repr(C)]
#[derive(Debug, Default, Copy, Clone, PartialEq)]
pub struct SJoystickState {
    pub count: u32,
    pub axis: [f32; 6usize],
    pub buttons: u16,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of SJoystickState"][::core::mem::size_of::<SJoystickState>() - 32usize];
    ["Alignment of SJoystickState"][::core::mem::align_of::<SJoystickState>() - 4usize];
    ["Offset of field: SJoystickState::count"]
        [::core::mem::offset_of!(SJoystickState, count) - 0usize];
    ["Offset of field: SJoystickState::axis"]
        [::core::mem::offset_of!(SJoystickState, axis) - 4usize];
    ["Offset of field: SJoystickState::buttons"]
        [::core::mem::offset_of!(SJoystickState, buttons) - 28usize];
};
#[repr(C)]
#[derive(Debug, Default, Copy, Clone, Hash, PartialEq, Eq)]
pub struct SKeyboardState {
    pub count: u32,
    pub scancode: u32,
    pub state: u32,
    pub modifiers: u32,
    pub ascii: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of SKeyboardState"][::core::mem::size_of::<SKeyboardState>() - 20usize];
    ["Alignment of SKeyboardState"][::core::mem::align_of::<SKeyboardState>() - 4usize];
    ["Offset of field: SKeyboardState::count"]
        [::core::mem::offset_of!(SKeyboardState, count) - 0usize];
    ["Offset of field: SKeyboardState::scancode"]
        [::core::mem::offset_of!(SKeyboardState, scancode) - 4usize];
    ["Offset of field: SKeyboardState::state"]
        [::core::mem::offset_of!(SKeyboardState, state) - 8usize];
    ["Offset of field: SKeyboardState::modifiers"]
        [::core::mem::offset_of!(SKeyboardState, modifiers) - 12usize];
    ["Offset of field: SKeyboardState::ascii"]
        [::core::mem::offset_of!(SKeyboardState, ascii) - 16usize];
};
pub type __gnuc_va_list = u32;
pub type va_list = __builtin_va_list;
pub type taskfunc = ::core::option::Option<unsafe extern "C" fn()>;
pub const ETaskState_TS_UNKNOWN: ETaskState = 0;
pub const ETaskState_TS_PAUSED: ETaskState = 1;
pub const ETaskState_TS_RUNNING: ETaskState = 2;
pub const ETaskState_TS_TERMINATING: ETaskState = 3;
pub const ETaskState_TS_TERMINATED: ETaskState = 4;
pub const ETaskState_TS_CREATED: ETaskState = 5;
pub type ETaskState = ::core::ffi::c_uint;
pub const ETaskHandlerState_TASK_IDLE: ETaskHandlerState = 0;
pub const ETaskHandlerState_TASK_SWITCHING: ETaskHandlerState = 1;
pub type ETaskHandlerState = ::core::ffi::c_uint;
pub const EBreakRequest_BR_NONE: EBreakRequest = 0;
pub const EBreakRequest_BR_HALTFORTASKSWITCH: EBreakRequest = 1;
pub type EBreakRequest = ::core::ffi::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub struct STask {
    pub HART: u32,
    pub runLength: u32,
    pub state: ETaskState,
    pub targetstate: ETaskState,
    pub exitCode: u32,
    pub regs: [u32; 32usize],
    pub name: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of STask"][::core::mem::size_of::<STask>() - 152usize];
    ["Alignment of STask"][::core::mem::align_of::<STask>() - 4usize];
    ["Offset of field: STask::HART"][::core::mem::offset_of!(STask, HART) - 0usize];
    ["Offset of field: STask::runLength"][::core::mem::offset_of!(STask, runLength) - 4usize];
    ["Offset of field: STask::state"][::core::mem::offset_of!(STask, state) - 8usize];
    ["Offset of field: STask::targetstate"][::core::mem::offset_of!(STask, targetstate) - 12usize];
    ["Offset of field: STask::exitCode"][::core::mem::offset_of!(STask, exitCode) - 16usize];
    ["Offset of field: STask::regs"][::core::mem::offset_of!(STask, regs) - 20usize];
    ["Offset of field: STask::name"][::core::mem::offset_of!(STask, name) - 148usize];
};
impl Default for STask {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub struct STaskContext {
    pub tasks: [STask; 5usize],
    pub state: ETaskHandlerState,
    pub brkreq: EBreakRequest,
    pub brkack: i32,
    pub currentTask: i32,
    pub numTasks: i32,
    pub kernelError: i32,
    pub kernelErrorData: [i32; 3usize],
    pub hartID: i32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of STaskContext"][::core::mem::size_of::<STaskContext>() - 800usize];
    ["Alignment of STaskContext"][::core::mem::align_of::<STaskContext>() - 4usize];
    ["Offset of field: STaskContext::tasks"][::core::mem::offset_of!(STaskContext, tasks) - 0usize];
    ["Offset of field: STaskContext::state"]
        [::core::mem::offset_of!(STaskContext, state) - 760usize];
    ["Offset of field: STaskContext::brkreq"]
        [::core::mem::offset_of!(STaskContext, brkreq) - 764usize];
    ["Offset of field: STaskContext::brkack"]
        [::core::mem::offset_of!(STaskContext, brkack) - 768usize];
    ["Offset of field: STaskContext::currentTask"]
        [::core::mem::offset_of!(STaskContext, currentTask) - 772usize];
    ["Offset of field: STaskContext::numTasks"]
        [::core::mem::offset_of!(STaskContext, numTasks) - 776usize];
    ["Offset of field: STaskContext::kernelError"]
        [::core::mem::offset_of!(STaskContext, kernelError) - 780usize];
    ["Offset of field: STaskContext::kernelErrorData"]
        [::core::mem::offset_of!(STaskContext, kernelErrorData) - 784usize];
    ["Offset of field: STaskContext::hartID"]
        [::core::mem::offset_of!(STaskContext, hartID) - 796usize];
};
impl Default for STaskContext {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type __FILE = __BindgenOpaqueArray<u32, 26usize>;
#[repr(C)]
#[repr(align(4))]
#[derive(Debug, Default, Copy, Clone, Hash, PartialEq, Eq)]
pub struct _glue {
    pub _bindgen_opaque_blob: [u32; 3usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _glue"][::core::mem::size_of::<_glue>() - 12usize];
    ["Alignment of _glue"][::core::mem::align_of::<_glue>() - 4usize];
};
#[repr(C)]
#[repr(align(8))]
pub struct _reent {
    pub _bindgen_opaque_blob: [u64; 36usize],
}
#[repr(C)]
#[repr(align(8))]
#[derive(Copy, Clone)]
pub union _reent__bindgen_ty_1 {
    pub _bindgen_opaque_blob: [u64; 25usize],
}
#[repr(C)]
#[repr(align(8))]
#[derive(Debug, Default, Copy, Clone, Hash, PartialEq, Eq)]
pub struct _reent__bindgen_ty_1__bindgen_ty_1 {
    pub _bindgen_opaque_blob: [u64; 25usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _reent__bindgen_ty_1__bindgen_ty_1"]
        [::core::mem::size_of::<_reent__bindgen_ty_1__bindgen_ty_1>() - 200usize];
    ["Alignment of _reent__bindgen_ty_1__bindgen_ty_1"]
        [::core::mem::align_of::<_reent__bindgen_ty_1__bindgen_ty_1>() - 8usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _reent__bindgen_ty_1"][::core::mem::size_of::<_reent__bindgen_ty_1>() - 200usize];
    ["Alignment of _reent__bindgen_ty_1"][::core::mem::align_of::<_reent__bindgen_ty_1>() - 8usize];
};
impl Default for _reent__bindgen_ty_1 {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _reent"][::core::mem::size_of::<_reent>() - 288usize];
    ["Alignment of _reent"][::core::mem::align_of::<_reent>() - 8usize];
};
impl Default for _reent {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type FILE = __FILE;
pub type fpos_t = _fpos_t;
pub const EVideoMode_EVM_320_Wide: EVideoMode = 0;
pub const EVideoMode_EVM_640_Wide: EVideoMode = 1;
pub const EVideoMode_EVM_Count: EVideoMode = 2;
pub type EVideoMode = ::core::ffi::c_uint;
pub const EColorMode_ECM_8bit_Indexed: EColorMode = 0;
pub const EColorMode_ECM_16bit_RGB: EColorMode = 1;
pub const EColorMode_ECM_Count: EColorMode = 2;
pub type EColorMode = ::core::ffi::c_uint;
pub const EVideoScanoutEnable_EVS_Disable: EVideoScanoutEnable = 0;
pub const EVideoScanoutEnable_EVS_Enable: EVideoScanoutEnable = 1;
pub const EVideoScanoutEnable_EVS_Count: EVideoScanoutEnable = 2;
pub type EVideoScanoutEnable = ::core::ffi::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub struct EVideoContext {
    pub m_vmode: EVideoMode,
    pub m_cmode: EColorMode,
    pub m_scanEnable: EVideoScanoutEnable,
    pub m_strideInWords: u32,
    pub m_scanoutAddressCacheAligned: u32,
    pub m_cpuWriteAddressCacheAligned: u32,
    pub m_graphicsWidth: u32,
    pub m_graphicsHeight: u32,
    pub m_consoleWidth: u16,
    pub m_consoleHeight: u16,
    pub m_cursorX: u16,
    pub m_cursorY: u16,
    pub m_consoleUpdated: u16,
    pub m_caretX: u16,
    pub m_caretY: u16,
    pub m_consoleColor: u8,
    pub m_caretBlink: u8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of EVideoContext"][::core::mem::size_of::<EVideoContext>() - 48usize];
    ["Alignment of EVideoContext"][::core::mem::align_of::<EVideoContext>() - 4usize];
    ["Offset of field: EVideoContext::m_vmode"]
        [::core::mem::offset_of!(EVideoContext, m_vmode) - 0usize];
    ["Offset of field: EVideoContext::m_cmode"]
        [::core::mem::offset_of!(EVideoContext, m_cmode) - 4usize];
    ["Offset of field: EVideoContext::m_scanEnable"]
        [::core::mem::offset_of!(EVideoContext, m_scanEnable) - 8usize];
    ["Offset of field: EVideoContext::m_strideInWords"]
        [::core::mem::offset_of!(EVideoContext, m_strideInWords) - 12usize];
    ["Offset of field: EVideoContext::m_scanoutAddressCacheAligned"]
        [::core::mem::offset_of!(EVideoContext, m_scanoutAddressCacheAligned) - 16usize];
    ["Offset of field: EVideoContext::m_cpuWriteAddressCacheAligned"]
        [::core::mem::offset_of!(EVideoContext, m_cpuWriteAddressCacheAligned) - 20usize];
    ["Offset of field: EVideoContext::m_graphicsWidth"]
        [::core::mem::offset_of!(EVideoContext, m_graphicsWidth) - 24usize];
    ["Offset of field: EVideoContext::m_graphicsHeight"]
        [::core::mem::offset_of!(EVideoContext, m_graphicsHeight) - 28usize];
    ["Offset of field: EVideoContext::m_consoleWidth"]
        [::core::mem::offset_of!(EVideoContext, m_consoleWidth) - 32usize];
    ["Offset of field: EVideoContext::m_consoleHeight"]
        [::core::mem::offset_of!(EVideoContext, m_consoleHeight) - 34usize];
    ["Offset of field: EVideoContext::m_cursorX"]
        [::core::mem::offset_of!(EVideoContext, m_cursorX) - 36usize];
    ["Offset of field: EVideoContext::m_cursorY"]
        [::core::mem::offset_of!(EVideoContext, m_cursorY) - 38usize];
    ["Offset of field: EVideoContext::m_consoleUpdated"]
        [::core::mem::offset_of!(EVideoContext, m_consoleUpdated) - 40usize];
    ["Offset of field: EVideoContext::m_caretX"]
        [::core::mem::offset_of!(EVideoContext, m_caretX) - 42usize];
    ["Offset of field: EVideoContext::m_caretY"]
        [::core::mem::offset_of!(EVideoContext, m_caretY) - 44usize];
    ["Offset of field: EVideoContext::m_consoleColor"]
        [::core::mem::offset_of!(EVideoContext, m_consoleColor) - 46usize];
    ["Offset of field: EVideoContext::m_caretBlink"]
        [::core::mem::offset_of!(EVideoContext, m_caretBlink) - 47usize];
};
impl Default for EVideoContext {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub struct EVideoSwapContext {
    pub cycle: u32,
    pub readpage: *mut u8,
    pub writepage: *mut u8,
    pub framebufferA: *mut u8,
    pub framebufferB: *mut u8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of EVideoSwapContext"][::core::mem::size_of::<EVideoSwapContext>() - 20usize];
    ["Alignment of EVideoSwapContext"][::core::mem::align_of::<EVideoSwapContext>() - 4usize];
    ["Offset of field: EVideoSwapContext::cycle"]
        [::core::mem::offset_of!(EVideoSwapContext, cycle) - 0usize];
    ["Offset of field: EVideoSwapContext::readpage"]
        [::core::mem::offset_of!(EVideoSwapContext, readpage) - 4usize];
    ["Offset of field: EVideoSwapContext::writepage"]
        [::core::mem::offset_of!(EVideoSwapContext, writepage) - 8usize];
    ["Offset of field: EVideoSwapContext::framebufferA"]
        [::core::mem::offset_of!(EVideoSwapContext, framebufferA) - 12usize];
    ["Offset of field: EVideoSwapContext::framebufferB"]
        [::core::mem::offset_of!(EVideoSwapContext, framebufferB) - 16usize];
};
impl Default for EVideoSwapContext {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type __builtin_va_list = u32;
unsafe extern "C" {
    pub static mut IO_AUDIOOUT: *mut u32;
    #[link_name = "\u{1}_Z17APUAllocateBufferj"]
    pub fn APUAllocateBuffer(_size: u32) -> *mut u8;
    #[link_name = "\u{1}_Z16APUSetBufferSizej"]
    pub fn APUSetBufferSize(audioBufferSize: u32);
    #[link_name = "\u{1}_Z11APUStartDMAj"]
    pub fn APUStartDMA(audioBufferAddress16byteAligned: u32);
    #[link_name = "\u{1}_Z16APUSetSampleRate14EAPUSampleRate"]
    pub fn APUSetSampleRate(sampleRate: EAPUSampleRate);
    #[link_name = "\u{1}_Z11E32ReadTimev"]
    pub fn E32ReadTime() -> u64;
